Revit 2026 API

# FabricationPartFlip Method

---

Flips the fabrication part that is directionally oriented (tees, crosses, valves, dampers, etc.) to the opposite direction.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Flip()
```
```vb
Public Function Flip As Boolean
```
```cpp
public:
bool Flip()
```
```fsharp
member Flip : unit -> bool
```

#### Return Value

Boolean Returns true if successful otherwise false if the fabrication part cannot be flipped.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | It is not a valid part that can be flipped. |

Existing connections will be maintained, disconnect warnings will be posted if the connection cannot be maintained.

#### Reference

FabricationPart Class

Autodesk.Revit.DB Namespace